Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Once a Flink YARN session is running, you can submit jobs to the session with the command ./bin/flink run ./path/to/job.jar.
zh_cn: 一旦Flink的YARN会话启动起来，你就可以利用命令"./bin/flink run ./path/to/job.jar"向会话中提交作业。

source: Once a job is scheduled for execution on the next batch, it cannot access the state of the pre‐ vious job.
zh_cn: 一旦作业调度到下个批次上执行，它将无法访问之前的状态。

source: Once a job is scheduled for execution on the next batch, it cannot access the state of the previous job.
zh_cn: 一旦某个作业被调度到下个批次上执行，它将无法访问之前的状态。

source: Once a sender receives a credit notification, it ships as many buffers as it was granted and the size of its backlog, i.e., the number of network buffers that are filled and ready to be shipped.
zh_cn: 一旦发送端收到信用通知，就会在信用度范围内传输尽可能多的缓冲，并附带积压量（已经填满准备传输的缓冲数目）大小。

source: Once a sender receives a credit notification, it ships as many buffers as it was granted and the size of its backlog—the number of network buffers that are filled and ready to be shipped.
zh_cn: 一旦发送端收到信用通知，就会在信用值所限定的范围内尽可能多地传输缓冲数据，并会附带上积压量（已经填满准备传输的网络缓冲数目）大小。

source: Once a transaction is committed, the markers are changed to commit‐ ted.
zh_cn: 一旦事务提交，这些标记就会被改为已提交。

source: Once a watermark has been received, operators are signaled that all timestamps for a certain time interval have been observed and either trigger computation or order received events.
zh_cn: 算子一旦收到某个水位线，就相当于接到信号：某个特定时间区间的时间戳已经到齐，可以触发窗口计算或对接收的数据进行排序了。

source: Once all barriers for a checkpoint have arrived, the operator checkpoints the state, which might now also include modifications caused by records that would usually belong to the next checkpoint.
zh_cn: 待所有的检查点分隔符都到达以后，算子才将状态存入检查点，这时候状态可能会包含一些由本应出现在下一次检查点的记录所引起的改动。

source: Once all checkpoint barriers have been emitted, the task starts to process the buffered records.
zh_cn: 任务在发出所有的检查点分隔符后就会开始处理缓冲的记录。

source: Once all pods are up, you will have a Flink cluster running on Kubernetes.
zh_cn: 待所有Pod都启动完毕，就意味着Flink集群在Kubernetes上成功运行起来。

source: Once all tasks are up and running, the pro‐ gram starts to produce its results, which should look similar to the following lines:
zh_cn: 一旦所有任务启动起来并开始运行，程序就会开始生成类似下面这样的结果：

source: Once an application is submitted for execution, it starts a JobManager and hands the application over.
zh_cn: 一旦某个应用提交执行，Dispatcher会启动一个JobManager并将应用转交给它。

source: Once another check‐ point (or savepoint) completes, you can safely remove a savepoint.
zh_cn: 在当前检查点（或保存点）完成后，你就可以安全地删除旧的保存点。

source: Once data has been emitted to a sink, it is difficult to guarantee result correctness, unless the sink system supports transactions.
zh_cn: 一旦数据从数据汇中写出，除非目标系统支持事务，否则结果的正确性将难以保证。

source: Once enough slots are available, Flink’s ResourceManager assigns them to the JobManager and the job execution starts.
zh_cn: 一旦有足够的处理槽，Flink的ResourceManager就会将它们分配给JobManager，使其可以运行作业。

source: Once everything has been set up, you can start the Flink cluster by calling ./bin/ start-cluster.sh.
zh_cn: 一切就绪后，你就可以利用./bin/start-cluster.sh脚本来启动Flink集群。

source: Once it is running, look for the JobID in the log file or the web UI; set the JobID in the code of the dashboard and run it as well.
zh_cn: 随后你需要从日志文件或Web UI中找到JobID，将其设置到代码中，并运行仪表盘应用。

source: Once it received enough TaskManager slots, it distributes the tasks of the ExecutionGraph to the TaskManagers that execute them.
zh_cn: 一旦它收到了足够的TaskManager处理槽，就会将ExecutionGraph中的任务分发给TaskManager来执行。

source: Once it receives an application, it starts a JobMan‐ ager and hands the application over.
zh_cn: 一旦接收了某个应用，Dispatcher会启动一个JobManager并将应用交付给它。

source: Once it receives enough Task‐ Manager slots, it distributes the tasks of the ExecutionGraph to the TaskManag‐ ers that execute them.
zh_cn: 一旦它收到了足够数量的TaskManager处理槽（slot），就会将ExecutionGraph中的任务分发给TaskManager来执行。

source: Once sampling is complete, you will see the back-pressure status in the second column.
zh_cn: 一旦采样结束，你就可以在第二列中看到背压状态。

source: Once started, the TaskManagers register their slots at Flink’s ResourceMan‐ ager, which provides them to the JobManager.
zh_cn: 一旦启动成功，TaskManager就会将自己的处理槽在Flink的ResourceManager中注册，后者会把它们提供给JobManager。

source: Once that is done, you can call ./bin/ start-zookeeper-quorum.sh to start a ZooKeeper process on each configured node.
zh_cn: 完成后，就可以调用./bin/start-zookeeper-quorum.sh在配置的节点上启动ZooKeeper进程。

source: Once that timer fires, the onTimer() method is called.
zh_cn: 一旦该计时器触发，就会调用onTimer()方法。

source: Once the application is run‐ ning again, you can take a savepoint.
zh_cn: 应用再次运行后，你就可以为其生成保存点。

source: Once the data has been imported into the data warehouse it can be queried and ana‐ lyzed.
zh_cn: 一旦数据导入数据仓库，就能对它们做查询分析。

source: Once the execution environment has been configured, it is time to do some actual work and start processing streams.
zh_cn: 在配置完执行环境后，我们就可以着手来做一些实质性的工作并对数据流开始正式处理。

source: Once the job terminates, the Flink cluster is stopped and all resources are returned.
zh_cn: 一旦作业结束，集群就会停止，全部资源都会归还。

source: Once the job-specific containers are running, you can treat the cluster as a regular Flink cluster as described in “Kubernetes” on page 228.
zh_cn: 在针对特定作业的容器运行后，你就可以像228页"Kubernetes"所介绍的那样，将集群视为常规的Flink集群。

source: Once the replay completes and the application is past the point at which it previously failed, the result will be consistent again.
zh_cn: 一旦重放完成，应用的进度超过了之前失败的点，其结果就会恢复一致。

source: Once the sender task completes, the data is sent as a batch over a temporary TCP connection to the receiver
zh_cn: 一旦发送端任务完成，所有数据会经由一个到接收端的临时TCP连接，以批量形式发送。

source: Once the sender task completes, the data is sent as a batch over a temporary TCP connection to the receiver.
zh_cn: 一旦发送端任务完成，所有数据会经由一个到接收端的临时TCP连接批量发出。

source: Once the state for a certain result has been purged, the result cannot be updated anymore and late events can only be dropped or redirected.
zh_cn: 一旦清除了针对特定结果的状态，这些结果就再也无法更新，而迟到事件也只能被丢弃或重定向。

source: Once they start running, the TaskManagers register themselves at the ResourceMan‐ ager.
zh_cn: 一旦它们运行起来，TaskManager就会将自己注册到ResourceManager中。

source: Once we have a DataStream, we can apply a transformation on it.
zh_cn: 一旦得到了DataStream对象，我们就可以对它应用转换。

source: Once you change operator identifiers or the maximum parallelism, you cannot start an application from a savepoint but have to start it from scratch without any state initialization.
zh_cn: 一旦你修改了算子标识或最大并行度则无法从保存点启动应用，只能选择抛弃状态从头开始运行。

source: Once you find a commit‐ ted file with the same task index and a higher ID, you can safely remove a pending file.
zh_cn: 如果你找到了一个具有相同任务索引号、ID更高的已经提交的文件，就可以把处于等待阶段的文件删除。

source: Once you obtain a state client, you can query the state of an application by calling the getKvState() method.
zh_cn: 在你得到一个状态客户端对象之后，就可以调用它的getKvState()方法来查询应用的状态。

source: Once your coffee is ready, the barista calls your name and you can pick up your coffee from the bench.
zh_cn: 咖啡制作完成后，店员会叫你的名字，你来从吧台取走咖啡。

source: Once your coffee is ready, the barista calls your name and you can pick up your coffee from the counter.
zh_cn: 咖啡制作完成后，咖啡师会叫你的名字，你来从吧台取走咖啡。

source: One appli‐ cation emits its output to an event log and another application consumes the events that the other application emitted.
zh_cn: 即上游应用将结果写入事件日志供下游应用消费使用。

source: One application emits its output to an event log and another application consumes the events the other appli‐ cation emitted.
zh_cn: 上游应用将结果写入事件日志供下游应用消费使用。

source: One example for such an assigner is the EventTimeSessionWindows assigner we discussed before, which works by creating a new window for each arriving element and merging overlapping win‐
zh_cn: 一个例子就是我们之前讨论过的EventTimeSessionWindows分配器，它需要为每个到来的元素创建一个新的窗口并在之后合并那些重叠的窗口。

source: One example would be when checkpoints take a long time but do not consume much resources; for example, due to operations with high-latency calls to external systems.
zh_cn: 一个例子是当生成检查点耗时较长但不会消耗太多资源（例如由于涉及外部系统调用的操作延迟很高）。

source: One of Flink’s most valued and unique features are savepoints.
zh_cn: Flink最具价值且独具一格的功能之一是保存点。

source: One of the most interesting applications of save‐ points we have seen in the wild is continuously migrating a streaming application to the datacenter that provides the lowest instance prices.
zh_cn: 我们在生态中见到保存点最奇葩应用之一是不断将流式应用迁移到实例价格最低的数据中心。

source: One operator (OP-1) has a single operator state (OS-1) and another operator (OP-2) has two keyed states (KS-1 and KS-2).
zh_cn: 其中一个算子（OP-1）有一个算子状态（OS-1），另一个算子（OP-2）有两个键值分区状态（KS-1和KS-2）。

source: One or more columns have to be defined as (composite) primary keys.
zh_cn: 其中必须有一个或多个列被定义为（符合）主键，

source: One reason is to break a chain of expensive functions in order to execute them on different processing slots.
zh_cn: 其中一种情况是我们希望将一连串负载较重的函数拆开，让它们在不同的处理槽内执行。

source: One restriction of the split transformation is that all outgoing streams are of the same type as the input type.
zh_cn: split转换限制了所有输出流的类型必须和输入流相同。

source: One way you can lower latency is by hiring a more skilled barista, i.e. one that prepares coffees faster.
zh_cn: 一种降低延迟的方法是雇佣更娴熟的咖啡师，他们制作咖啡会更快一些。

source: Online gaming is a simple scenario showing how operator semantics should depend on the time when events actually happen and not the time when the application receives the events.
zh_cn: 在线游戏这个简单场景展示了算子语义应该依赖事件实际发生时间而非应用收到事件的时间。

source: Only Use Kryo as a Fallback Solution
zh_cn: 仅将Kryo作为后备方案

source: Only Use Rolling Aggregations on Bounded Key Domains
zh_cn: 只对有限键值域使用滚动聚合

source: Only Use Rolling Reduce on Bounded Key Domains
zh_cn: 只对有限键值域使用滚动reduce操作

source: Only the split operator allows splitting a stream into multiple streams of the same type.
zh_cn: 只有split算子可以将一条流拆分成多条类型相同的流。

source: Only when execute() is called does the system trig‐
zh_cn: 只有在调用execute()方法时，系统才会触发程序执行。

source: Open Flink’s Web UI by entering the URL http://localhost:8081 in your browser.
zh_cn: 在浏览器中输入URL http://localhost:8081，打开Flink Web UI。

source: Open Flink’s Web UI on by entering the URL http://localhost:8081 in your browser.
zh_cn: 在你浏览器中输入URL http://localhost:8081，打开Flink Web UI。

source: Open a terminal and run the following Git command to clone the examples-scala
zh_cn: 打开终端运行以下Git命令将examples-scala库克隆到你的机器上：1

source: Open a terminal and run the following command to create a Flink Maven Quickstart Scala project as a starting point for your Flink application:
zh_cn: 你可以打开终端运行以下命令来创建Flink Maven Quickstart Scala项目，并以它为基础开发Flink应用：

source: Open source communities are constantly improving the capabilities of their projects and are pushing the technical boundaries of stream pro‐ cessing.
zh_cn: 开源社区通过不断增强它们项目的功能在流处理领域开疆拓土。

source: Open source software is a major driver of this trend, mainly due to two reasons.
zh_cn: 开源软件之所以能够主导这一趋势，主要有两方面原因：

source: Open source software is a major driver of this trend, mainly due to two reasons:
zh_cn: 开源软件之所以能够主导这一趋势，主要有两方面原因：

source: Open source stream processing software is a commodity that everybody can eval‐ uate and use.
zh_cn: 开源流处理软件作为一件商品，所有人都可以评估和使用它；

source: Operating Flink and Streaming
zh_cn: Flink和流式应用运维

source: Operating Flink and Streaming Applications.
zh_cn: Flink和流式应用运维

source: Operation of a window join
zh_cn: 基于窗口的Join操作

source: Operations based on event time are predictable and their results are deterministic.
zh_cn: 基于事件时间的操作是可预测的，其结果具有确定性。

source: Operations based on event-time are predictable and their results deterministic.
zh_cn: 基于事件时间的操作是可预测的，它们的结果非常确定。

source: Operations can be either stateless or stateful.
zh_cn: 这些操作既可以是无状态（stateless）的，也可以是有状态（stateful）的。

source: Operations on Data Streams
zh_cn: 数据流上的操作

source: Operations on data streams
zh_cn: 数据流上的操作

source: Operator State
zh_cn: 算子状态

source: Operator Unique Identifiers and Maximum Parallelism Are Baked into Savepoints
zh_cn: 算子唯一标识和最大并行度会被固化到保存点中

source: Operator state cannot be accessed by another task of the same or a different operator.
zh_cn: 算子状态不能通过其他任务访问，无论该任务是否来自相同算子。

source: Operator state in streaming jobs is very valuable and should be guarded against fail‐ ures.
zh_cn: 流式作业中的算子状态十分宝贵，因此需要在故障时予以保护。

source: Operator state is managed per parallel instance of an operator.
zh_cn: 算子状态的维护是按照每个算子并行实例来分配的。

source: Operator state is scoped to an operator task.
zh_cn: 算子状态的作用域是某个算子任务，

source: Operator state will not be stored locally and needs to be retrieved from the remote storage system.
zh_cn: 算子状态不会存储在本地，而是需要从远程存储系统中获取。

source: Operator:
zh_cn: 算子：

source: Operators A and C are sources and operator E is a sink.
zh_cn: 其中算子A和C是数据源，算子E是数据汇。

source: Operators C and E have a parallelism of two.
zh_cn: 算子C和E的并行度为2，

source: Operators are executed in parallel by one or more operator tasks.
zh_cn: 算子会在一个或多个任务上并行执行，

source: Operators are the basic functional units of a dataflow application.
zh_cn: 算子是Dataflow程序的基本功能单元，

source: Operators can accept multiple inputs and produce multiple output streams.
zh_cn: 算子既可以同时接收多个输入流或产生多条输出流，

source: Operators keep latency statistics in a latency gauge that contains min, max, and mean values, as well as 50, 95, and 99 percentile values.
zh_cn: 算子会将延迟统计信息保存在Gauge指标中，其中包含最小值，最大值，平均值以及50、95和99百分位数。

source: Operators that extend GenericWriteAheadSink need to provide three constructor parameters:
zh_cn: 继承自GenericWriteAheadSink的算子需要在构造方法内提供三个参数：

source: Operators that implement data ingestion logic are called data sources.
zh_cn: 实现数据接入操作逻辑的算子称为数据源（data source）。

source: Operators that need to be notified about completed check‐
zh_cn: 算子为了感知检查点创建成功，可以实现CheckpointListener接口。

source: Operators that perform data egress are called data sinks and exam‐ ples include files, databases, message queues, and monitoring interfaces.
zh_cn: 负责数据输出的算子称为数据汇（data sink），其写入的目标包括文件、数据库、消息队列、监控接口等。

source: Operators that perform data egress are called data sinks and examples include files, databases, message queues, and monitoring interfaces.
zh_cn: 负责数据输出的算子称为数据汇（data sink），其写入的目标可以是文件、数据库、消息队列以及监控接口等。

source: Operators with keyed state are scaled by repartitioning keys to fewer or more tasks.
zh_cn: 带有键值分区状态的算子在扩缩容时会根据新的任务数量对键值重新分区。

source: Operators with operator broadcast state are scaled up by copying the state to new tasks.
zh_cn: 带有算子广播状态的算子在扩缩容时会把状态拷贝到全部新任务上。

source: Operators with operator list state are scaled by redistributing the list entries.
zh_cn: 带有算子列表状态的算子在扩缩容时会对列表中的条目进行重新分配。

source: Operators with operator union list state are scaled by broadcasting the full list of state entries to each task.
zh_cn: 带有算子联合列表状态的算子会在扩缩容时把状态列表的全部条目广播到全部任务上。

source: Operators without input ports are called data sources and opera‐ tors without output ports are called data sinks.
zh_cn: 没有输入口的算子称为数据源，没有输出口的算子称为数据汇。

source: Operators, Tasks, and Processing Slots.
zh_cn: 算子、任务以及处理槽。

source: Operators, tasks, and processing slots
zh_cn: 算子、任务以及处理槽。

source: Option is not defined if the state has not been initialized yet.
zh_cn: 如果状态尚未初始化则Option为None。

source: Optionally output the result to one or more data sinks.
zh_cn: 选择性地将结果输出到一个或多个数据汇中。

source: Other features include support to upgrade application code or migrate a job to a different cluster or a new version of the stream processor without losing the current state.
zh_cn: 此外还有一些新的特性，例如：支持应用代码更新，在不丢失当前状态的前提下将作业迁移至一个新的集群或新版本的流处理引擎等。

source: Other features include support to upgrade application code or migrating a job to a different cluster or a new version of the stream processor without losing the current state of an application.
zh_cn: 还有一些特性包括支持应用代码升级，在不丢失当前状态的前提下将作业迁移至一个新的集群或新版本的流处理引擎等。

source: Others more interested in writing Flink code right away might want to read the practical chapters first.
zh_cn: 或者如果你迫不及待地想开始编写Flink代码，也可以先阅读实践章节。

source: Otherwise job recovery might miss metadata that was stored in the temporary directory and fail.
zh_cn: 否则作业在进行恢复时可能会因为找不到临时目录中的元数据而失败。

source: Otherwise, it returns a local environment.
zh_cn: 否则会返回一个本地环境。

source: Otherwise, the default savepoint directory as configured in the flink-conf.yaml file is used.
zh_cn: 否则，Flink会使用flink-conf.yaml文件中配置的默认保存点路径。

source: Otherwise, the operator would have to store the complete stream history.
zh_cn: 否则算子就需要存储整个流的历史记录。

source: Otherwise, the program fails with a ConnectException because a connection to
zh_cn: 否则程序会因为无法建立套接字连接而抛出ConnectException。

source: Otherwise, the window operator will accu‐ mulate more and more state over time and your application will probably fail at some
zh_cn: 否则窗口算子的状态会越积越多，最终可能导致你的应用在某个时间出现故障。

source: Our TransactionalFileSink in Example 8-15 checks if the transaction file still exists and deletes it if that is the case.
zh_cn: 示例8-15中的TransactionalFileSink会检查事务文件是否存在，如果存在则将它删除。

source: Our code exam‐ ples use Scala for conciseness, but the Java API is mostly analogous (exceptions or special cases will be pointed out).
zh_cn: 出于简洁考虑，我们的示例代码还会以Scala版本为主，但绝大多数的Java API都与之类似（如果有例外或特殊情况会指出）。

source: Our example application ingests a stream of temperature meas‐ urements from multiple sensors.
zh_cn: 示例应用会从多个传感器中获取温度测量数据流。

source: Our implementation in Example 8-15
zh_cn: 示例8-15中，该方法的实现方式是强制写出并关闭事务文件。

source: Output the Result
zh_cn: 输出结果

source: Output the result
zh_cn: 输出结果

source: Over the years the collection and usage of data has grown consistently, and compa‐ nies have designed and built infrastructures to manage that data.
zh_cn: 随着数据采集和使用量的不断增长，很多公司都设计并构建了各种基础架构来管理数据。

source: Overriding Source-Generated Timestamps and Watermarks
zh_cn: 覆盖数据源生成的时间戳和水位线

source: POJO class with Cassandra Object Mapper annotations
zh_cn: 添加了Cassandra Object Mapper注解的POJO类

source: POJO or case class fields are selected by their field name like in the above example.
zh_cn: POJO或样例类的字段也可以像上面那样根据字段名称进行选择。

source: POJOs
zh_cn: POJO

source: POJOs, including classes generated by Apache Avro
zh_cn: POJO（包括Apache Avro生成的类）

source: Pairs of joined events are passed into a ProcessJoinFunction.
zh_cn: Join成功的事件对会发送给ProcessJoinFunction。

source: ParallelSourceFunction and RichParallelSourceFunction can be used to define source connectors that run with multiple parallel task instances.
zh_cn: ParallelSourceFunction和RichParallelSourceFunction可用于定义能够同时运行多个任务实例的数据源连接器。

source: Parallelization gets complicated, since results depend on both the state and incoming events.
zh_cn: 由于结果需要同时依赖状态和到来的事件，所以状态并行化会变得异常复杂。

source: Parameters The ID of a job as provided by the list application command.
zh_cn: 参数 jobId：使用列出应用命令所得到的作业ID。

source: Parameters The file must be sent as multipart data Action
zh_cn: 参数 文件必须以Multipart数据形式上传 行为

source: Parameters The path of the savepoint to dispose needs to be provided as a parameter in a JSON object Action
zh_cn: 参数 需要以JSON对象的形式提供要删除的保存点路径 行为

source: Parameters jarId: The ID of the JAR file as provided by the list JAR file command
zh_cn: 参数 jarId：使用列出JAR文件命令所得到的JAR文件ID

source: Parameters jarId: The ID of the JAR file from which the application is started.
zh_cn: 参数 jarId：启动应用的JAR文件ID

source: Parameters jobID: The ID of a job as provided by the list application command.
zh_cn: 参数 jobID：使用列出应用命令所得到的应用ID。

source: Parameters jobId: The ID of a job as provided by the list application command
zh_cn: 参数 jorId：使用列出应用命令所得到的作业ID

source: Parameters jobId: The ID of a job as provided by the list application command Action
zh_cn: 参数 jobId：使用列出应用命令所得到的作业ID 行为

source: Parameters tmId: The ID of a connected TaskManager
zh_cn: 参数 tmId：相连TaskManager的ID

source: Partitioning transformations correspond to the data exchange strategies we intro‐ duced in “Data Exchange Strategies” on page 19.
zh_cn: Flink中的各类分区转换对应我们在第19页"数据交换策略"一节中介绍的多种数据交换策略。

source: Pattern detection or complex event processing (CEP), e.g., for fraud detection in credit card transactions, and
zh_cn: 模式识别或复杂事件处理（CEP）（例如：根据信用卡交易记录进行反欺诈），

source: Pattern detection or complex event processing (e.g., for fraud detection in credit card transactions)
zh_cn: 模式识别或复杂事件处理（例如：根据信用卡交易记录进行欺诈识别）。

source: Pause the ingestion of all input streams.
zh_cn: 暂停接收所有输入流。

source: Pending Files Might Never Be Committed
zh_cn: 处于等待阶段的文件可能永远无法提交

source: Performace Implications of Checkpointing
zh_cn: 检查点对性能的影响

source: Performance and Robustness of Stateful Applications
zh_cn: 状态化应用的性能及鲁棒性

source: Performance and Robustness of Stateful Applications | 169
zh_cn: 状态化应用的性能及鲁棒性 | 169

source: Performance and Robustness of Stateful Applications | 171
zh_cn: 状态化应用的性能及鲁棒性 | 171

source: Performance and Robustness of Stateful Applications | 173
zh_cn: 状态化应用的性能及鲁棒性 | 173

source: Periodic assigner: The DataStream API provides a user-defined function called AssignerWithPeriodicWatermarks that extracts a timestamp from each record and is periodically queried for the current watermark.
zh_cn: 周期分配器（periodic assigner）：DataStream API提供了一个名为AssignerWithPeriodicWatermarks的用户自定义函数，它可以用来从每条记录提取时间戳，并周期性地响应获取当前水位线的查询请求。

source: Persistent event logs write all events to durable storage, so that they can be replayed if a task fails.
zh_cn: 持久化事件日志会将所有事件写入永久存储，这样在任务故障时就可以重放它们。

source: Playing online mobile games in the subway.
zh_cn: 地铁上玩在线手游。

source: Please note that Figure 3-1 is a high-level sketch to visualize the responsibilities and interactions of the components.
zh_cn: 注意，图3-1仅仅从一个较高层次上展示了各组件的职责与交互。

source: Policies can be based on time (e.g. events received in the last 5 seconds), on count (e.g. the last 100 events), or on a data property.
zh_cn: 决策可以基于时间（例如：最近5秒钟接收的事件）、数量（例如：最新100个事件）或其他数据属性。

source: Policies can be based on time (e.g., events received in the last five seconds), on count (e.g., the last one hundred events), or on a data property.
zh_cn: 策略的指定可以基于时间（例如：最近5秒钟接收的事件）、数量（例如：最新100个事件）或其他数据属性。

source: Possible consistency values are:
zh_cn: 可能的一致性选项有：

source: Preaggregation and Evictors
zh_cn: 预聚合与移除器

source: Preface
zh_cn: 序言

source: Preface | xi
zh_cn: 序言 | xi

source: Preface | xiii
zh_cn: 序言 | xiii

source: Preface.
zh_cn: 序言

source: Preventing Leaking State
zh_cn: 防止状态泄露

source: Previously in this chapter, we described the common architecture for data analytics pipelines.
zh_cn: 本章前面已经介绍了数据分析管道的通用架构。

source: Primitives
zh_cn: 原始类型

source: Process Functions
zh_cn: 处理函数

source: Process Functions | 117
zh_cn: 处理函数 | 117

source: Process Functions | 121
zh_cn: 处理函数 | 121

source: Process functions are com‐ monly used to build event-driven applications and to implement custom logic for which predefined windows and transformations might not be suitable.
zh_cn: 处理函数常被用于构建事件驱动型应用，或实现一些内置窗口及转换可能不太适合的自定义逻辑。

source: Process functions are discussed in more detail in Chapter 6.
zh_cn: 我们会在第6章详细讨论处理函数。

source: Process functions can also be implemented to support late data.
zh_cn: 我们同样可以在处理函数中应对数据迟到的情况，

source: Process functions can emit a record to one or more side outputs via the
zh_cn: 处理函数可以利用Context对象将记录发送至一个或多个副输出。

source: ProcessWindowFunction is a very powerful window function, but you need to use it with caution since it typically holds more data in state than incrementally aggregating
zh_cn: ProcessWindowFunction是一个功能十分强大的窗口函数，但你在用它的时候需要小心，因为它和增量聚合函数比起来通常需要在状态中保存更多数据。

source: Processing Streams in Parallel
zh_cn: 并行流处理

source: Processing Streams in Parallel | 21
zh_cn: 并行数据流处理 | 21

source: Processing Time
zh_cn: 处理时间

source: Processing Time Versus Event Time
zh_cn: 处理时间 vs. 事件时间

source: Processing streams in parallel
zh_cn: 并行数据流处理

source: Processing time
zh_cn: 处理时间

source: Processing time is the time of the local clock on the machine where the operator pro‐ cessing the stream is being executed.
zh_cn: 处理时间是当前流处理算子所在机器上的本地时钟时间。

source: Processing time vs. event time
zh_cn: 处理时间 vs. 事件时间

source: Processing- time windows trigger based on machine time and include whatever elements happen to have arrived at the operator until that point in time.
zh_cn: 处理时间窗口基于机器时间触发，它可以涵盖触发时间点之前到达算子的任意元素。

source: Processing-time can be applicable for applications with very low latency requirements.
zh_cn: 处理时间能够用在具有极低延迟需求的应用中。
